Repository: Moomak/PimPid
Catalog: macos/PimPid/Resources/*.lproj/Localizable.strings
Languages: th

# app.tagline
source: Thai ⇄ English Converter
th: ไทย ⇄ English Converter

# settings.general.title
source: General
th: ทั่วไป

# settings.exclude.title
source: Exclude Words
th: Exclude คำ

# settings.appearance.title
source: Appearance
th: รูปลักษณ์

# settings.about.title
source: About
th: เกี่ยวกับ

# menu.settings
source: Settings
th: ตั้งค่า

# stats.today
source: Today
th: วันนี้

# stats.total
source: Total
th: ทั้งหมด

# stats.times
source: times
th: ครั้ง

# stats.last7days
source: Last 7 days
th: 7 วันที่ผ่านมา

# button.use_defaults
source: Use defaults
th: ใช้ค่าเริ่มต้น

# button.clear_recent
source: Clear recent
th: ล้างรายการล่าสุด

# button.undo_last
source: Undo last conversion
th: ยกเลิกการแปลงล่าสุด

# button.add
source: Add
th: เพิ่ม

# button.close
source: Close
th: ปิด

# stats.header
source: Statistics
th: สถิติ

# recent.header
source: Recent Conversions
th: แปลงล่าสุด

# recent.no_history
source: No history yet
th: ยังไม่มีประวัติ

# time.just_now
source: Just now
th: เมื่อสักครู่

# time.minutes_ago
source: %dm ago
th: %dน. ที่แล้ว

# time.hours_ago
source: %dh ago
th: %dชม. ที่แล้ว

# time.days_ago
source: %dd ago
th: %dวัน ที่แล้ว

# toggle.enable
source: Enable
th: เปิดใช้งาน

# a11y.toggle_enable
source: Enable PimPid
th: เปิดใช้งาน PimPid

# a11y.toggle_hint
source: Toggle all PimPid functionality
th: สลับการทำงานของ PimPid ทั้งหมด

# a11y.autocorrect_label
source: Enable Auto-Correct
th: เปิด Auto-Correct

# a11y.autocorrect_hint
source: Auto-correct text when typing in wrong language
th: แก้ไขข้อความอัตโนมัติเมื่อพิมพ์ผิดภาษา

# accessibility.warning
source: Accessibility permission required
th: ต้องการสิทธิ์ Accessibility

# accessibility.open_settings
source: Open Settings
th: เปิดการตั้งค่า

# autocorrect.toggle
source: Enable Auto-Correct
th: เปิดใช้งาน Auto-Correct

# autocorrect.description
source: Automatically correct text when typing in the wrong language
th: แก้ไขข้อความอัตโนมัติทันทีที่พิมพ์ผิดภาษา

# autocorrect.section.enable
source: Enable
th: การเปิดใช้งาน

# autocorrect.delay
source: Delay:
th: ความล่าช้า:

# autocorrect.delay_hint
source: Wait time before auto-correcting (0–1000 ms, 0 = default 200 ms)
th: เวลารอก่อนแก้ไขอัตโนมัติ (0–1000 ms, 0 = ใช้ค่าเริ่มต้น 200 ms)

# autocorrect.min_chars
source: Minimum characters:
th: จำนวนตัวอักษรขั้นต่ำ:

# autocorrect.chars_unit
source: %d chars
th: %d ตัว

# autocorrect.min_chars_hint
source: Minimum characters to type before auto-correction starts
th: ต้องพิมพ์อย่างน้อยกี่ตัวอักษรก่อนจะเริ่มแก้ไขอัตโนมัติ

# autocorrect.section.settings
source: Correction Settings
th: ตั้งค่าการแก้ไข

# autocorrect.layout_picker
source: Thai keyboard layout
th: Layout คีย์บอร์ดไทย

# autocorrect.layout_hint
source: Use mapping based on selected layout (Patta Choti requires KeyboardLayout-PattaChoti.plist in app)
th: ใช้ mapping ตาม layout ที่เลือก (Patta Choti ต้องมีไฟล์ KeyboardLayout-PattaChoti.plist ในแอป)

# autocorrect.section.layout
source: Thai Layout
th: Layout ไทย

# autocorrect.sound
source: Sound notification
th: เสียงแจ้งเตือน

# autocorrect.visual_feedback
source: Show notification on auto-correct
th: แสดงการแจ้งเตือนเมื่อแก้ไขอัตโนมัติ

# autocorrect.section.notification
source: Sound & Notifications
th: เสียง และการแจ้งเตือน

# autocorrect.bundle_placeholder
source: Bundle ID (e.g. com.apple.Safari)
th: Bundle ID (เช่น com.apple.Safari)

# autocorrect.add_from_running
source: Add from running apps…
th: เพิ่มจากแอปที่เปิดอยู่…

# autocorrect.exclude_hint
source: Add Bundle IDs of apps to exclude from auto-correct
th: เพิ่ม Bundle ID ของแอปที่ไม่ต้องการให้ auto-correct ทำงาน

# autocorrect.no_excluded_apps
source: No excluded apps yet
th: ยังไม่มีแอปที่ถูก exclude

# autocorrect.exclude_window
source: Exclude this window
th: Exclude หน้าต่างนี้

# autocorrect.exclude_window_hint
source: Excludes only the focused window (not the entire app)
th: เพิ่มเฉพาะหน้าต่างที่โฟกัสอยู่ (ไม่ใช่ทั้งแอป)

# autocorrect.no_excluded_windows
source: No excluded windows yet
th: ยังไม่มีหน้าต่างที่ exclude

# autocorrect.pick_app_title
source: Select an app to add to Excluded Apps
th: เลือกแอปเพื่อเพิ่มเข้า Excluded Apps

# section.reset
source: Reset
th: รีเซ็ต

# section.info
source: Info
th: ข้อมูล

# info.howto.title
source: How to use
th: วิธีใช้งาน

# info.howto.desc
source: Auto-correct triggers when you type a word and press Space or Enter
th: Auto-correct จะทำงานทันทีเมื่อคุณพิมพ์คำและกด Space หรือ Enter

# info.benefit.title
source: Benefit
th: ประโยชน์

# info.benefit.desc
source: Just keep typing — PimPid will auto-correct when it detects wrong-language typing
th: แค่พิมพ์ไปเรื่อยๆ PimPid จะแก้ไขอัตโนมัติเมื่อตรวจพบการพิมพ์ผิดภาษา

# info.note.title
source: Note
th: หมายเหตุ

# info.note.desc
source: Auto-correct may slightly slow typing in some apps
th: Auto-correct อาจทำให้การพิมพ์ช้าลงเล็กน้อยในบางแอป

# appearance.theme_auto
source: System
th: ตามระบบ

# appearance.theme_light
source: Light
th: สว่าง

# appearance.theme_dark
source: Dark
th: มืด

# appearance.font_small
source: Small
th: เล็ก

# appearance.font_medium
source: Medium
th: ปกติ

# appearance.font_large
source: Large
th: ใหญ่

# appearance.notify_minimal
source: Minimal
th: แบบย่อ

# appearance.notify_off
source: Off
th: ปิด

# appearance.toast_sec
source: %@ sec
th: %@ วินาที

# appearance.theme_picker
source: Color theme
th: ธีมสี

# appearance.theme_hint
source: Choose app color scheme (Settings → About and Menu)
th: เลือกโทนสีของแอป (ตั้งค่า → เกี่ยวกับ และเมนู)

# appearance.section.theme
source: Color Theme
th: ธีมสี

# appearance.font_picker
source: Font size
th: ขนาดตัวอักษร

# appearance.font_hint
source: Applied to menu and settings pages
th: ใช้กับเมนูและหน้าตั้งค่า

# appearance.section.font
source: Font Size
th: ขนาดตัวอักษร

# appearance.notify_picker
source: Notification style
th: สไตล์การแจ้งเตือน

# appearance.notify_hint
source: Toast = show text after conversion, Minimal = shorter, Off = hidden
th: Toast = แสดงข้อความหลังแปลง, แบบย่อ = สั้นลง, ปิด = ไม่แสดง

# appearance.section.notify
source: Notifications
th: การแจ้งเตือน

# appearance.toast_picker
source: Toast display duration
th: ระยะเวลาแสดง Toast

# appearance.section.toast
source: Toast Duration
th: ระยะเวลา Toast

# appearance.nav_title
source: Appearance
th: รูปลักษณ์

# general.toggle
source: Enable PimPid
th: เปิดใช้งาน PimPid

# general.description
source: When enabled, PimPid runs in the background and is ready to convert text
th: เมื่อเปิดใช้งาน PimPid จะทำงานในเบื้องหลังและพร้อมแปลงข้อความ

# general.section.basic
source: Basic Operation
th: การทำงานพื้นฐาน

# general.version
source: Version
th: เวอร์ชัน

# general.status
source: Status
th: สถานะ

# general.status.active
source: ✅ Active
th: ✅ ใช้งาน

# general.status.paused
source: ⏸️ Paused
th: ⏸️ หยุดชั่วคราว

# general.nav_title
source: General
th: ทั่วไป

# shortcut.current
source: Current shortcut
th: Shortcut ปัจจุบัน

# shortcut.switch_back
source: Switch back to previous layout
th: กลับไป layout เดิม

# shortcut.footer
source: Select mistyped text and press the shortcut to convert by key position (Kedmanee ↔ QWERTY). If the shortcut conflicts with another app, change it in Settings.
th: เลือกข้อความที่พิมพ์ผิดภาษาแล้วกด shortcut เพื่อแปลงตามตำแหน่งปุ่ม (Kedmanee ↔ QWERTY). ถ้า shortcut ชนกับแอปอื่น ให้เปลี่ยน key ใน Settings นี้

# exclude.placeholder
source: Word to exclude from conversion
th: คำที่ไม่ต้องการให้แปลง

# exclude.hint
source: Enter words you don't want PimPid to convert (e.g. names, brands, jargon)
th: ป้อนคำที่ไม่ต้องการให้ PimPid แปลง เช่น ชื่อ, แบรนด์, คำศัพท์เฉพาะ

# exclude.section.add
source: Add Word
th: เพิ่มคำ

# exclude.no_words
source: No excluded words yet
th: ยังไม่มีคำที่ exclude

# exclude.no_match
source: No words matching "%@"
th: ไม่มีคำที่ตรงกับ "%@"

# exclude.section.list
source: Exclude List (%d words)
th: รายการ Exclude (%d คำ)

# exclude.search
source: Search list
th: ค้นหาในรายการ

# exclude.sort
source: Sort
th: เรียง

# exclude.duplicate
source: This word is already in the list
th: คำนี้มีอยู่แล้วในรายการ

# exclude.paste_result
source: Added %d words (skipped %d duplicates)
th: เพิ่ม %d คำ (ข้ามคำซ้ำ %d คำ)

# exclude.import_result
source: Imported %d words
th: นำเข้า %d คำ

# exclude.export_message
source: Save exclude list (one word per line)
th: บันทึกรายการ exclude (บรรทัดละคำ)

# exclude.nav_title
source: Exclude Words
th: Exclude คำ

# about.version
source: Version %@ (%@)
th: เวอร์ชัน %@ (%@)

# about.description1
source: Convert Thai ⇄ English text by keyboard key position (Kedmanee / QWERTY)
th: แปลงข้อความไทย ⇄ อังกฤษ ตามตำแหน่งปุ่มคีย์บอร์ด (Kedmanee / QWERTY)

# about.description2
source: Supports Auto-Correct while typing and exclude word list
th: รองรับ Auto-Correct ขณะพิมพ์ และรายการคำ exclude

# about.quickstart.step1.title
source: Enable PimPid
th: เปิดใช้งาน PimPid

# about.quickstart.step1.desc
source: Click the menu bar icon and toggle 'PimPid Enable'
th: คลิก menu bar icon และเปิด toggle 'PimPid เปิดใช้งาน'

# about.quickstart.step2.title
source: Grant Accessibility
th: ให้สิทธิ์ Accessibility

# about.quickstart.step2.desc
source: Allow PimPid keyboard access in System Settings
th: อนุญาตให้ PimPid เข้าถึงคีย์บอร์ดใน System Settings

# about.quickstart.step3.title
source: Enable Auto-Correct
th: เปิด Auto-Correct

# about.quickstart.step3.desc
source: Turn on Auto-Correct for automatic correction when wrong-language typing is detected
th: เปิดใช้ Auto-Correct เพื่อแก้ไขอัตโนมัติขณะพิมพ์เมื่อตรวจพบการพิมพ์ผิดภาษา

# about.check_update
source: Check for updates
th: ตรวจสอบการอัปเดต

# about.section.more
source: More Info
th: ข้อมูลเพิ่มเติม

# about.loading_thai
source: Loading Thai words... %d%%
th: โหลดคำไทย... %d%%

# about.thai_credit
source: Thai word list: wannaphong/thai-wordlist, korakot/thainlp (Apache 2.0)
th: รายการคำไทย: wannaphong/thai-wordlist, korakot/thainlp (Apache 2.0)

# about.export_json
source: Export Stats (JSON)
th: Export สถิติ (JSON)

# about.export_csv
source: Export Stats (CSV)
th: Export สถิติ (CSV)

# about.nav_title
source: About
th: เกี่ยวกับ

# onboarding.welcome.title
source: Welcome to PimPid
th: ยินดีต้อนรับสู่ PimPid

# onboarding.welcome.desc
source: An app that converts Thai ⇄ English text by keyboard key position
th: แอปที่ช่วยแปลงข้อความไทย ⇄ อังกฤษ ตามตำแหน่งปุ่มคีย์บอร์ด

# onboarding.shortcut.desc
source: Select mistyped text and press ⌘⇧L to convert instantly (change shortcut in Settings)
th: เลือกข้อความที่พิมพ์ผิดภาษาแล้วกด ⌘⇧L เพื่อแปลงทันที (เปลี่ยน shortcut ได้ใน Settings)

# onboarding.autocorrect.desc
source: Enable Auto-Correct for PimPid to automatically fix wrong-language typing as you type
th: เปิดใช้ Auto-Correct เพื่อให้ PimPid แก้ไขอัตโนมัติขณะพิมพ์เมื่อตรวจพบการพิมพ์ผิดภาษา

# onboarding.accessibility.title
source: Grant Accessibility
th: ให้สิทธิ์ Accessibility

# onboarding.accessibility.desc
source: PimPid needs Accessibility permission for Auto-Correct to work
th: PimPid ต้องการสิทธิ์ Accessibility เพื่อให้ Auto-Correct ทำงานได้

# onboarding.back
source: Back
th: ย้อนกลับ

# onboarding.skip
source: Skip
th: ข้าม

# onboarding.next
source: Next
th: ถัดไป

# onboarding.open_system_settings
source: Open System Settings
th: เปิด System Settings

# onboarding.granted_hint
source: If permission is granted, come back and press Done
th: ถ้าให้สิทธิ์แล้ว ให้กลับมาแล้วกด เสร็จสิ้น

# onboarding.open_pimpid_settings
source: Open PimPid Settings
th: เปิดการตั้งค่า PimPid

# onboarding.done
source: Done
th: เสร็จสิ้น
